In [1]:
#create a dataframe using lists

#pandas represent everything in the form of columns(coulmn matrix)

#Dataframe means represting in the form of matrix

list====datframe

dict=====dataframe

In [2]:
names=["ayush","avinas","shashank"]

In [3]:
import pandas as pd

In [6]:
#empty dataframe
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
pd.DataFrame(names)

          0
0     ayush
1    avinas
2  shashank

In [5]:
type(pd.DataFrame(names))

pandas.core.frame.DataFrame

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'

first positionla argument is data

second positional argument is index

In [ ]:
#step 2 Index

In [10]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
pd.DataFrame(names,age)
#in this code age is considered as index because it is second argument in dataframe function  to overcome this we need use zip function

#here names is first positional argument

#age is second positional argument

           0
25     ayush
30    avinas
35  shashank

In [9]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
pd.DataFrame(zip(names,age))

          0   1
0     ayush  25
1    avinas  30
2  shashank  35

In [15]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000]
pd.DataFrame(zip(names,age,salary))

          0   1     2
0     ayush  25  1000
1    avinas  30  2000
2  shashank  35  3000

In [17]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000,4000]
pd.DataFrame(zip(names,age,salary))

#check here 4000 is not displayed

          0   1     2
0     ayush  25  1000
1    avinas  30  2000
2  shashank  35  3000

In [22]:
#if we want to display salary as index then we need give salary as second argument

names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000]
pd.DataFrame(zip(names,age),salary)

             0   1
1000     ayush  25
2000    avinas  30
3000  shashank  35

In [23]:
# we can do like this also
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000]
pd.DataFrame(zip(names,age),index=salary)

             0   1
1000     ayush  25
2000    avinas  30
3000  shashank  35

In [25]:
# step 3 providing custom column names instead of 0,1,2

#the third positional parameter in Dataframe function is coulmnname called "columns"

In [30]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000]
pd.DataFrame(zip(names,age),index=salary,columns=['names','age'])

         names  age
1000     ayush   25
2000    avinas   30
3000  shashank   35

In [33]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000,4000]
df=pd.DataFrame(zip(names,age,salary),columns=['names','age','salary'])
print(df)

      names  age  salary
0     ayush   25    1000
1    avinas   30    2000
2  shashank   35    3000

In [34]:
#step 4 important adding extra column to existing dataframe

** add new column **

-if we want add new column

-first we need to check the number of rows in the existing dataframe

-in df dataframe we have 3 rows

-we need create a new list with 3 rows

-that list should be equated to dataframe

In [36]:
cities=["hyd","bang","chennai"]

df['place']=cities

In [37]:
df

      names  age  salary    place
0     ayush   25    1000      hyd
1    avinas   30    2000     bang
2  shashank   35    3000  chennai

In [38]:
#updating column values should be done similarly
df['age']=[10,11,12]

In [39]:
df

      names  age  salary    place
0     ayush   10    1000      hyd
1    avinas   11    2000     bang
2  shashank   12    3000  chennai

In [40]:
#step 6 chnage the index

In [50]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000,4000]
cities=["hyd","bang","chennai"]
df=pd.DataFrame(zip(names,age,salary,cities),index=['a','b','c'],columns=['names','age','salary','place'])
print(df)

      names  age  salary    place
a     ayush   25    1000      hyd
b    avinas   30    2000     bang
c  shashank   35    3000  chennai

** Note **

number of lists =number of columns

number of elemnts in list=number of columns

# step 7 
 to find number of rows and number of columns

In [51]:
df.shape

(3, 4)

In [52]:
print("the number of rows is:" ,df.shape[0])

the number of rows is: 3

In [53]:
print("the number of columns:",df.shape[1])

the number of columns: 4

# step 7 
 how to drop column

 very important

    inorder to drop the column we need three parameters
    1)column name:
        the columnname which needs to be removed

    2)axis:(very imp)

        axis=0  this will represent rows

        axis=1 this will represent columns

    3)inplace(very imp)

        we are deleting a column we are modifying the dataframe

        so the modifications we need to save in same or different variable

        if we want to store the chanages to same variable the inplace ="True"

df.drop(
    labels: 'IndexLabel | None' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel | None' = None,
    columns: 'IndexLabel | None' = None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
)

In [55]:
df.drop(columns='place',axis=1,inplace=True)

In [56]:
df

      names  age  salary
a     ayush   25    1000
b    avinas   30    2000
c  shashank   35    3000

In [62]:
#here we are deleting the age column but doesnt affect df beacause inplace!= true
df1=df.drop(columns='age',axis=1)

In [63]:
df

      names  age  salary
a     ayush   25    1000
b    avinas   30    2000
c  shashank   35    3000

In [64]:
df1

      names  salary
a     ayush    1000
b    avinas    2000
c  shashank    3000

#step 9

deleting multile columns

In [65]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000,4000]
cities=["hyd","bang","chennai"]
df=pd.DataFrame(zip(names,age,salary,cities),index=['a','b','c'],columns=['names','age','salary','place'])
print(df)

      names  age  salary    place
a     ayush   25    1000      hyd
b    avinas   30    2000     bang
c  shashank   35    3000  chennai

In [66]:
df.drop(columns=['age','salary'],axis=1,inplace=True)

In [67]:
df

      names    place
a     ayush      hyd
b    avinas     bang
c  shashank  chennai

In [74]:
#step 10 drop rows

#inorder to delete rows we should just give index value without parameter

In [69]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
salary=[1000,2000,3000,4000]
cities=["hyd","bang","chennai"]
df=pd.DataFrame(zip(names,age,salary,cities),index=['a','b','c'],columns=['names','age','salary','place'])
print(df)

      names  age  salary    place
a     ayush   25    1000      hyd
b    avinas   30    2000     bang
c  shashank   35    3000  chennai

In [71]:
df.drop(coulmns='a',axis=0,inplace=True)

TypeError: DataFrame.drop() got an unexpected keyword argument 'coulmns'

In [72]:
df.drop('a',axis=0,inplace=True)

In [73]:
df

      names  age  salary    place
b    avinas   30    2000     bang
c  shashank   35    3000  chennai

#how to save dataframe to local machine

generally daatframes are two types

    1)CSV=Comma separated values(.csv)

    2)Excel(.xlsx)

In [77]:
#this will download the dataframe with index
df.to_csv("data.csv")

In [78]:
#if we want to download Dataframe without index
df.to_csv("data.csv",index=False)

In [1]:
#Eda session 2

#how to read a Dataframe

inorder to read dtaframe we need 

Location

Filename

Extension

In [4]:
import pandas as pd

In [5]:
pd.read_csv("data.csv")

      names  age  salary    place
0    avinas   30    2000     bang
1  shashank   35    3000  chennai

In [6]:
pd.read_csv("/Users/shashankreddy/Downloads/bank - bank.csv")

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [8]:
pd.read_csv("/Users/shashankreddy/nareshit/Datafiles/Visadataset - Visadataset.csv")

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

#sometimes the data doesnt load properly in that time look into the data and Look for separator(which parameter is separiting the data)

These are parameters of read

the second is sep =","   it will split data with , .

if we set sep =
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols: 'list[HashableT] | Callable[[Hashable], bool] | None' = None,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters: 'Mapping[Hashable, Callable] | None' = None,
    true_values: 'list | None' = None,
    false_values: 'list | None' = None,
    skipinitialspace: 'bool' = False,
    skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values: 'Sequence[str] | Mapping[str, Sequence[str]] | None' = None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool' = False,
    skip_blank_lines: 'bool' = True,
    parse_dates: 'bool | Sequence[Hashable] | None' = None,
    infer_datetime_format: 'bool | lib.NoDefault' = <no_default>,
    keep_date_col: 'bool' = False,
    date_parser: 'Callable | lib.NoDefault' = <no_default>,
    date_format: 'str | None' = None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    on_bad_lines: 'str' = 'error',
    delim_whitespace: 'bool' = False,
    low_memory: 'bool' = True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions | None' = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
)

In [9]:
#create daatframe using dictionary

In [12]:
names=["ayush","avinas","shashank"]
age=[25,30,35]
pd.DataFrame(names,age)

           0
25     ayush
30    avinas
35  shashank

In [16]:

#keys becomes column names

#values becomes rows

In [14]:
dict1={"names":["ayush","avinas","shashank"],
      "ages":[25,30,35]}
pd.DataFrame(dict1)

      names  ages
0     ayush    25
1    avinas    30
2  shashank    35

In [17]:
#If using all scalar values, you must pass an index

#scalar value means single value

# This is very Important

In [15]:
dict2={
    "name":"shashank",
    "age":30,
    "city":"HYD"
}
pd.DataFrame(dict2)

ValueError: If using all scalar values, you must pass an index

In [20]:
dict2={
    "name":"shashank",
    "age":30,
    "city":"HYD"
}
pd.DataFrame(dict2,index=[1])

       name  age city
1  shashank   30  HYD

In [21]:
dict2={
    "name":"shashank",
    "age":30,
    "city":"HYD"
}
pd.DataFrame(dict2,index=[2])

       name  age city
2  shashank   30  HYD

In [23]:
#The same data will be passed with different index number

In [24]:
dict2={
    "name":"shashank",
    "age":30,
    "city":"HYD"
}
pd.DataFrame(dict2,index=[1,2,3])

       name  age city
1  shashank   30  HYD
2  shashank   30  HYD
3  shashank   30  HYD